
	

var rows = [1];	
var cols = [0,3];
var agregate=[2];
var data_col=4;	
var filter = []
var data_headers=["Анкета","город","объект","месяц"]

 	var data =[  
["Сильпо ЦЕНТР Хилинский","Да","Входная группа, торговый зал","В торговом зале имеются таблички с указа","15","15.00","100.00","15"],
["Сильпо ЦЕНТР Хилинский","Да","Входная группа, торговый зал","В торговом зале комфортная температура (","15","15.00","100.00","15"],
["Сильпо ЦЕНТР Хилинский","Да","Входная группа, торговый зал","В торговом зале чисто","15","15.00","100.00","15"],
["Сильпо ЦЕНТР Хилинский","Да","Входная группа, торговый зал","Есть в наличии чистые и исправные тележк","30","30.00","100.00","15"],
["Сильпо ЦЕНТР Хилинский","Да","Входная группа, торговый зал","Есть возможность оставить вещи в ячейке ","15","15.00","100.00","15"],
["Сильпо ЦЕНТР Хилинский","Да","Входная группа, торговый зал","Парковка и входная зона чистые","6","6.00","100.00","6"],
["Сильпо ЦЕНТР Хилинский","Да","Входная группа, торговый зал","Проходы в торговом зале свободны","14","14.00","100.00","14"],
["Сильпо ЦЕНТР Хилинский","Да","Качество товара","Молочный отдел. Нет просроченной продукц","60","60.00","100.00","15"],
["Сильпо ЦЕНТР Хилинский","Да","Качество товара","Отдел Гастрономия. Вся продукция свежая,","13","13.00","100.00","13"],
["Сильпо ЦЕНТР Хилинский","Да","Качество товара","Отдел Кулинария. Вся продукция кулинарии","30","30.00","100.00","15"],
["Сильпо ЦЕНТР Хилинский","Да","Качество товара","Отдел Мясо. Вся продукция свежая и качес","15","15.00","100.00","15"],
["Сильпо ЦЕНТР Хилинский","Да","Качество товара","Отдел Овощи/Фрукты. Овощи, фрукты, зелен","26","26.00","100.00","13"],
["Сильпо ЦЕНТР Хилинский","Да","Качество товара","Отдел Рыба. Вся продукция свежая. Вся ры","15","15.00","100.00","15"],
["Сильпо ЦЕНТР Хилинский","Да","Обслуживание в отделах","Передо мной в очереди к прилавку/весам с","15","15.00","100.00","15"],
["Сильпо ЦЕНТР Хилинский","Да","Обслуживание в отделах","Продавец оказал необходимую помощь в выб","30","30.00","100.00","15"],
["Сильпо ЦЕНТР Хилинский","Да","Обслуживание в отделах","Продавец приветливо поздоровался со мной","8","8.00","100.00","4"],
["Сильпо ЦЕНТР Хилинский","Да","Обслуживание в отделах","Продавец сказал завершающую фразу","10","10.00","100.00","5"],
["Сильпо ЦЕНТР Хилинский","Да","Обслуживание на кассе","Кассир приветливо поздоровался, спросил ","12","12.00","100.00","6"],
["Сильпо ЦЕНТР Хилинский","Да","Обслуживание на кассе","Меня поблагодарили за покупку и сказали ","12","12.00","100.00","6"],
["Сильпо ЦЕНТР Хилинский","Да","Обслуживание на кассе","Мне быстро и правильно дали сдачу","10","10.00","100.00","10"],
["Сильпо ЦЕНТР Хилинский","Да","Обслуживание на кассе","Передо мной в очереди к кассе стояло не ","15","15.00","100.00","15"],
["Сильпо ЦЕНТР Хилинский","Да","Обслуживание на кассе","Товары в моем чеке соответствовали покуп","15","15.00","100.00","15"],
["Сильпо ЦЕНТР Хилинский","Да","Общее впечатление","Все сотрудники магазина, которые встреча","15","15.00","100.00","15"],
["Сильпо ЦЕНТР Хилинский","Да","Общее впечатление","Все сотрудники магазина, которые встреча","30","30.00","100.00","15"],
["Сильпо ЦЕНТР Хилинский","Да","Общее впечатление","Основываясь на впечатлениях от этого виз","45","45.00","100.00","15"],
["Сильпо ЦЕНТР Хилинский","Нет","Входная группа, торговый зал","Парковка и входная зона чистые","0","9.00","0.00","9"],
["Сильпо ЦЕНТР Хилинский","Нет","Входная группа, торговый зал","Проходы в торговом зале свободны","0","1.00","0.00","1"],
["Сильпо ЦЕНТР Хилинский","Нет","Качество товара","Отдел Гастрономия. Вся продукция свежая,","0","2.00","0.00","2"],
["Сильпо ЦЕНТР Хилинский","Нет","Качество товара","Отдел Овощи/Фрукты. Овощи, фрукты, зелен","0","4.00","0.00","2"],
["Сильпо ЦЕНТР Хилинский","Нет","Обслуживание в отделах","Продавец приветливо поздоровался со мной","0","22.00","0.00","11"],
["Сильпо ЦЕНТР Хилинский","Нет","Обслуживание в отделах","Продавец сказал завершающую фразу","0","20.00","0.00","10"],
["Сильпо ЦЕНТР Хилинский","Нет","Обслуживание на кассе","Кассир приветливо поздоровался, спросил ","0","18.00","0.00","9"],
["Сильпо ЦЕНТР Хилинский","Нет","Обслуживание на кассе","Меня поблагодарили за покупку и сказали ","0","18.00","0.00","9"],
["Сильпо ЦЕНТР Хилинский","Нет","Обслуживание на кассе","Мне быстро и правильно дали сдачу","0","5.00","0.00","5"]   ];
/*
      ,sum(pfi.value*(case q.weight when 0 then 0 when null then 0 else q.weight end)) as ball
     ,sum((case q.weight when 0 then 0 when null then 0 else q.weight*q.max_ball end)) as max_ball
     ,case q.weight when 0 then 0 when null then 0 else  
        (case q.max_ball when 0 then 0 when null then 0 else round(sum(pfi.value*q.weight)*100/sum(q.weight*q.max_ball),2)  end)
         end  as percent 
     ,count(*) as cnt 
*/        
var rows = [0,2,3];   
var cols = [1];
var agregate=[];

var data_col=4;   
var data_col_max_ball=5;  
var data_col_percent=6;  
var data_col_cnt=7; 
var filter = [];
var data_headers=["Анкета","ответ","блок","вопрос","рейтинг, %"];
