	var data =[
	
["БОРИСПОЛЬ Киевская тр, 76","10","105.00","150.00","70.00"],
["БОРИСПОЛЬ Киевская тр, 76","11","137.00","150.00","91.33"],
["БОРИСПОЛЬ Киевская тр, 76","12","129.00","150.00","86.00"],
["КИЕВ Драйзера ул, 21","10","112.00","150.00","74.67"],
["КИЕВ Драйзера ул, 21","11","122.00","150.00","81.33"],
["КИЕВ Драйзера ул, 21","12","86.00","150.00","57.33"],
["КИЕВ Драйзера ул, 8","10","136.00","150.00","90.67"],
["КИЕВ Драйзера ул, 8","11","111.00","150.00","74.00"],
["КИЕВ Драйзера ул, 8","12","80.00","150.00","53.33"],
["КИЕВ Закревского ул, 61/2","10","116.00","150.00","77.33"],
["КИЕВ Закревского ул, 61/2","11","112.00","150.00","74.67"],
["КИЕВ Закревского ул, 61/2","12","80.00","150.00","53.33"],
["КИЕВ Карельский пер, 3","10","122.00","150.00","81.33"],
["КИЕВ Карельский пер, 3","11","107.00","150.00","71.33"],
["КИЕВ Карельский пер, 3","12","103.00","150.00","68.67"],
["КИЕВ Лесной пр, 39","10","110.00","150.00","73.33"],
["КИЕВ Лесной пр, 39","11","123.00","150.00","82.00"],
["КИЕВ Лесной пр, 39","12","106.00","150.00","70.67"],
["КИЕВ Маяковского пр, 75/2","10","120.00","150.00","80.00"],
["КИЕВ Маяковского пр, 75/2","11","101.00","150.00","67.33"],
["КИЕВ Маяковского пр, 75/2","12","87.00","150.00","58.00"],
["КИЕВ Радужная ул, 8","10","116.00","150.00","77.33"],
["КИЕВ Радужная ул, 8","11","134.00","150.00","89.33"],
["КИЕВ Радужная ул, 8","12","142.00","150.00","94.67"],
["КИЕВ Стальского ул, 22/1","10","126.00","150.00","84.00"],
["КИЕВ Стальского ул, 22/1","11","108.00","150.00","72.00"],
["КИЕВ Стальского ул, 22/1","12","104.00","150.00","69.33"],
["СЛАВУТИЧ Привокзальная ул, 5","11","105.00","150.00","70.00"],
["СЛАВУТИЧ Привокзальная ул, 5","12","314.00","375.00","83.73"]
];	
var rows = [0,3];	
var cols = [1];
var data_col=4;	
var filter = []
var data_headers=["город","объект","ddd","TAG"]